CSI API ETABS v1
cLoadPatterns.GetSelfWTMultiplier Method
 Retrieves the self weight multiplier for a specified load pattern.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSelfWTMultiplier(
	string Name,
	ref double SelfWTMultiplier
)
Function GetSelfWTMultiplier (
	Name As String,
	ByRef SelfWTMultiplier As Double
) As Integer
Dim instance As cLoadPatterns
Dim Name As String
Dim SelfWTMultiplier As Double
Dim returnValue As Integer
returnValue = instance.GetSelfWTMultiplier(Name,
	SelfWTMultiplier)
int GetSelfWTMultiplier(
	String^ Name,
	double% SelfWTMultiplier
)
abstract GetSelfWTMultiplier :
        Name : string *
        SelfWTMultiplier : float byref -> int
Parameters
Name
Type: System.String
 The name of an existing load pattern.
SelfWTMultiplier
Type: System.Double
 The self weight multiplier for the specified load pattern.
Return Value
Type: Int32
 Returns zero if the multiplier is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim SelfWTMultiplier As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'get self weight multiplier
       ret = SapModel.LoadPatterns.GetSelfWtMultiplier("DEAD", SelfWTMultiplier)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cLoadPatterns Interface
ETABSv1 Namespace